In [4]:
import pandas as pd

member=pd.Series(data=['홍길동','전우치','강감찬','스티브잡스'])
member

0      홍길동
1      전우치
2      강감찬
3    스티브잡스
dtype: object

In [6]:
import pandas as pd

member=pd.Series(data=['홍길동','전우치','강감찬','스티브잡스'], index=['1번','2번','3번','4번'])
member

1번      홍길동
2번      전우치
3번      강감찬
4번    스티브잡스
dtype: object

In [7]:
member['1번']

'홍길동'

In [8]:
member[ ['1번','3번'] ]

1번    홍길동
3번    강감찬
dtype: object

In [10]:
sal_1 = {'일지매' : 130 , '전우치' : 120, '홍길동':100}
sal_2 = pd.Series(data=sal_1)
sal_2

일지매    130
전우치    120
홍길동    100
dtype: int64

In [11]:
sal_3 = {'홍길동' : 10 , '전우치' : 12, '강감찬':20}
sal_4 = pd.Series(data=sal_3)
sal_4

홍길동    10
전우치    12
강감찬    20
dtype: int64

In [12]:
print(sal_2 + sal_4)

강감찬      NaN
일지매      NaN
전우치    132.0
홍길동    110.0
dtype: float64

In [36]:
member3 = {'번호' : ['1번','2번','3번'] ,
        '이름' : ['홍길동','전우치','강감찬'],
        '생년' : [1975 , 1980 , 1992] }
member4 = pd.DataFrame(data=member3)
member4

   번호   이름    생년
0  1번  홍길동  1975
1  2번  전우치  1980
2  3번  강감찬  1992

In [35]:
member5 = [['1번', '홍길동', '1975'],['2번', '잔우치', '1982'], ['3번', '강감찬', '1980']]
member6 = pd.DataFrame(data=member5, columns=['번호', '번호', '생년'])
member6

   번호   번호    생년
0  1번  홍길동  1975
1  2번  잔우치  1982
2  3번  강감찬  1980

In [44]:
member6.sort_values('생년', ascending = False).style.hide(axis='index')

In [45]:
import pandas as pd


data = pd.read_excel('부품구입대장2.xls')
data

         신청날짜 사업장          품목  수량       단가        금액
0  2019-08-23  석수       ANGLE  21    32000    672000
1  2019-09-09  석수          백관  44    56000   2464000
2  2019-06-18  석수         절연판  40    45000   1800000
3  2019-03-13  석수  P/Z O-RING  11    38000    418000
4  2019-05-11  석수         알코올  38     8000    304000
5  2019-06-28  석수         실리콘  30   150000   4500000
6  2019-02-16  석수         소모품   4     2200      8800
7  2019-10-22  석수       MOTOR  14    30000    420000
8  2019-03-18  석수  PAPER BRSH  13    40000    520000
9  2019-07-17  석수        불화카리  23    83000   1909000
10 2019-07-23  석수         마크펜  33     3000     99000
11 2019-03-20  석수         NUT  20    15000    300000
12 2019-01-27  석수         윤활유  30  2000000  60000000
13 2019-07-11  석수         소모품  50     2200    110000
14 2019-05-16  석수        BITE  14    86000   1204000

In [46]:
import pandas as pd
data = pd.read_csv('사원별판매현황_홍길동.csv', names=['이름','요일','실적'], encoding='cp949')
data

    이름   요일   실적
0   이름   요일   실적
1  홍길동  월요일  100
2  홍길동  화요일   70
3  홍길동  수요일   80
4  홍길동  목요일   85
5  홍길동  금요일   65
6  홍길동  토요일   95
7  홍길동  일요일  120

In [52]:
member4['생년']

0    1975
1    1980
2    1992
Name: 생년, dtype: int64

In [58]:
member4.loc[1:2]

   번호   이름    생년
1  2번  전우치  1980
2  3번  강감찬  1992